---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FunctionParam
source: html/69cf0c7b-6bd4-27bf-e3c8-1dc3cccf65f8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FunctionParam Property

"Function"

## Syntax (C#)
```csharp
public static ForgeTypeId FunctionParam { get; }
```